<template>
	<div @click="play()">
		<svg
			t="1681118275576"
			class="icon"
			viewBox="0 0 1024 1024"
			version="1.1"
			xmlns="http://www.w3.org/2000/svg"
			p-id="10081"
			width="25"
			height="25"
		>
			<path
				d="M972.016 533.48a43.03 43.03 0 0 1-72.451 31.349l-0.114 0.114-386.346-384.976v-0.014l-1.1-1.033v-0.01l-386.57 385.182-0.019-0.019a43.037 43.037 0 1 1-60.152-61.56L480.926 88.34a43.021 43.021 0 0 1 31.08-13.207h0.019c0.758 0 1.516 0.019 2.274 0.067 0.114 0 0.228 0.019 0.36 0.019 0.645 0.048 1.289 0.1 1.933 0.163 0.038 0 0.1 0.01 0.133 0.01a43.088 43.088 0 0 1 26.816 13.417l0.038-0.029 169.672 169.091v-39.507a43.124 43.124 0 0 1 86.248 0v125.444l160.955 160.36-0.114 0.105a42.586 42.586 0 0 1 11.676 29.207z m-86.248 71.62v300.8a43.054 43.054 0 0 1-43.133 42.969h-86.25V605.1h-172.5v343.768H181.38a43.038 43.038 0 0 1-43.115-42.969v-300.8L512.006 232.69z m-445.643 0H267.628v171.884h172.5V605.1z"
				p-id="10082"
				class="icon-path Home"
			></path>
		</svg>
		<span>首页</span>
	</div>
</template>

<script>
import mixi from './mixins';
export default {
	name: 'HomeIcon',
	mixins: [mixi],
	data() {
		return {
			iconName: 'Home',
		};
	},
};
</script>

<style scoped >

.icon-path {
	fill: '#fff';
	stroke: '#fff';
	stroke-dashoffset: 0;
	stroke-width: 10;
}
</style>
